#   ИМПОРТЫ
#-------------------------------------------------------------#
import textwrap
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ ДЛЯ ГЛАВНОГО МЕНЮ
#-------------------------------------------------------------#
def no_start_text():
    return textwrap.dedent('''
    🎲Добро пожаловать в бота уебан!

    ⚔️Здесь ты можешь уебать любого человека и объявить его уебаном!
    Небойся, за это тебе ничего не будет, лишь только можешь получить в ответ)

    🔰Для ознакомления с командами, введите /help
    Кнопочки снизу)
    ''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ ДЛЯ УЖЕ ЗАРЕГИСТРИРОВАЛСЯ
#-------------------------------------------------------------#
def yes_start_text():
    return textwrap.dedent('''
    🔰Как я вижу по своим уебским базам, вы уже зарегистрированы, увы..

    🔰Для ознакомления с командами, введите /help
    все полезные кнопочки снизу
    ''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ ДЛЯ /HELP
#-------------------------------------------------------------#
def commands_text():
    return textwrap.dedent('''
    🔰Команды:
    <b>уебать (ответ на сообщение)</b> - Уебать любого человека
                           
    /start - <b>Начало работы с ботом</b>
    /rank - <b>Система рангов</b>
    /rate - Узнать курс обмена(он меняется раз в 24ч)
                           
    +обмен у или ж - <b>обмен vipcoin на удары(у) или жизни(ж)</b>
    +ник (ваш ник) - <b>смена ника</b>
                           
    П, профиль, п - <b>ваш профиль</b>
    
    ''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ РАНГОВ С ВСТРОЕННОЙ ПРОВЕРКОЙ НА ЗВАНИЕ ПОЛЬЗОВАТЕЛЯ
#-------------------------------------------------------------#
def rank_text(user_rank: str):
    return textwrap.dedent(f'''
    ┎<b>На данный момент есть 7 рангов</b> 🌟
    ┖<b>Каждый ранг дает преимущества!</b>
                           
    ┎⚔️ Ранг: <b>Лох{'</b> (ваше звание)' if user_rank == 'лох' else '</b>'}
    ┣📒 <b>Требования:</b> 1 удар
    ┖🚀 <b>Преимущества:</b> бонус +30 жизней/ударов

    ┎⚔️ Ранг: <b>Никто{'</b> (ваше звание)' if user_rank == 'никто' else '</b>'}
    ┣📒 <b>Требования:</b> 100 ударов
    ┖🚀 <b>Преимущества:</b> бонус +40 жизней/ударов
    
    ┎⚔️ Ранг: <b>Норм Чел{'</b> (ваше звание)' if user_rank == 'норм чел' else '</b>'}
    ┣📒 <b>Требования:</b> 250 ударов
    ┖🚀 <b>Преимущества:</b> бонус +50 жизней/ударов
    
    ┎⚔️ Ранг: <b>Крутой Чел{'</b> (ваше звание)' if user_rank == 'крутой чел' else '</b>'}
    ┣📒 <b>Требования:</b> 450 ударов
    ┖🚀 <b>Преимущества:</b> бонус +60 жизней/ударов
    
    ┎⚔️ Ранг: <b>Пацан{'</b> (ваше звание)' if user_rank == 'пацан' else '</b>'}
    ┣📒 <b>Требования:</b> 600 ударов
    ┖🚀 <b>Преимущества:</b> бонус +70 жизней/ударов
    
    ┎⚔️ Ранг: <b>Забивной{'</b> (ваше звание)' if user_rank == 'забивной' else '</b>'}
    ┣📒 <b>Требования:</b> 800 ударов
    ┖🚀 <b>Преимущества:</b> бонус +80 жизней/ударов
    
    ┎⚔️ Ранг: <b>Главный{'</b> (ваше звание)' if user_rank == 'главный' else '</b>'}
    ┣📒 <b>Требования:</b> 1000 ударов
    ┖🚀 <b>Преимущества:</b> бонус +90 жизней/ударов                      
    ''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ ДЛЯ УДАРА
#-------------------------------------------------------------#
def reply_message(opponent_name, opponent_username, selected_user, opponent, next_rang):
    return textwrap.dedent(f'''
        ┎⚔️ Ты успешно уебал уебка! <a href='https://t.me/@{opponent_username}/'>{opponent_name}</a>
        ┃
        ┣🔰 У тебя остался(ось) {selected_user.fuck} удар(ов)
        ┣❤️ У <a href='https://t.me/@{opponent_username}/'>{opponent_name}</a>, осталось {opponent.lives} жизнь(ей)
        ┖🏆 До нового ранга: {next_rang}
    ''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


#   ТЕКСТ ДЛЯ ПРОФИЛЯ
#-------------------------------------------------------------#
def profile_text(profile, next_rang):
    return textwrap.dedent(f'''
    ┎🔍 <b>Профиль пользователя</b> 🔍
    ┃
    ┣💎 Привилегия: {profile.vip_rank}
    ┃
    ┣🎲 Ранг: {profile.rank}
    ┣👤 Имя: <b>{profile.nick}</b>
    ┣💰 vipcoin: <b>{profile.vip_balance}</b>
    ┣❤️ Жизней осталось: <b>{profile.lives}</b>
    ┃
    ┣📅 Дата регистрации:
    ┃               <b>{profile.registration_time}</b>
    ┃
    ┣⚔️ Осталось ударов: <b>{profile.fuck}</b>
    ┣📥 Макс ударов: <b>{profile.fucked_up}</b>
    ┣🏆 До нового ранга осталось:
    ┃               {next_rang} удар(ов)
    ┃
    ┣ <b>Закончились жизни и удары?
    ┣ Жми кнопку ниже ⬇</b>
    ┗━━━━━━━━━━━━━━━━━━━━━━━
''')
#-------------------------------------------------------------#
#-------------------------------------------------------------#


def rate_text(rate_life, rate_hit):
    return textwrap.dedent(f'''
    ┎<b>💎Курс обмена vipcoin💎</b>
    ┗-<i>vipcoin умножается на rate-</i>
    ┃                      
    ┎<code>❤️ 1 vipcoin - {rate_life}% жизни</code>
    ┣<code>⚔️ 1 vipcoin - {rate_hit}% ударов</code>
    ┃
    ┣⌚Каждые 24 часа наша система обновляет курс
    ┗🔇Не бойтесь, вам придет уведомление о новом курсе!
    ┃
    ┎<b>🔰Проценты выпадения курса:</b>
    ┃<i>-1 число умножается на vipcoin-</i>
    ┃
    ┣💹 1.5: 60%
    ┣💹 2: 40%
    ┣💹 3: 35%
    ┣💹 4: 30%
    ┣💹 5: 20%
    ┗💹 10: 5%

''')
