import textwrap



trigger = ['уебать', 'Уебать', 'Ебнуть', 'ебануть', 'Ебануть', 'ебнуть', 'fuck', 'е', 'Е']


def no_start_text():
    return textwrap.dedent('''
    Добро пожаловать в бота уебан!

    Здесь ты можешь уебать любого человека и объявить его уебаном!
    Небойся, за это тебе ничего не будет, лишь только можешь получить в ответ)

    Для ознакомления с командами, введите /help
    Кнопочки снизу)
    ''')

def yes_start_text():
    return textwrap.dedent('''
    Как я вижу по своим уебским базам, вы уже зарегистрированы, увы..

    Для ознакомления с командами, введите /help
    все полезные кнопочки снизу
    ''')

def commands_text():
    return textwrap.dedent('''
    Команды:
    /start - <b>Начало работы с ботом</b>
    /rank - <b>Система рангов</b>
    <b>уебать (ответ на сообщение)</b> - Уебать любого человека
    ''')
 
def rank_text(user_rank: str):
    return textwrap.dedent(f'''
    ┎<b>На данный момент есть 7 рангов</b> 🌟
    ┖<b>Каждый ранг дает преимущества!</b>
                           
    ┎⚔️ Ранг: <b>Лох{'</b> (ваше звание)' if user_rank == 'лох' else '</b>'}
    ┣📒 <b>Требования:</b> 1 удар
    ┖🚀 <b>Преимущества:</b> бонус +30 жизней/ударов

    ┎⚔️ Ранг: <b>Никто{'</b> (ваше звание)' if user_rank == 'никто' else '</b>'}
    ┣📒 <b>Требования:</b> 100 ударов
    ┖🚀 <b>Преимущества:</b> бонус +40 жизней/ударов
    
    ┎⚔️ Ранг: <b>Норм Чел{'</b> (ваше звание)' if user_rank == 'норм чел' else '</b>'}
    ┣📒 <b>Требования:</b> 250 ударов
    ┖🚀 <b>Преимущества:</b> бонус +50 жизней/ударов
    
    ┎⚔️ Ранг: <b>Крутой Чел{'</b> (ваше звание)' if user_rank == 'крутой чел' else '</b>'}
    ┣📒 <b>Требования:</b> 450 ударов
    ┖🚀 <b>Преимущества:</b> бонус +60 жизней/ударов
    
    ┎⚔️ Ранг: <b>Пацан{'</b> (ваше звание)' if user_rank == 'пацан' else '</b>'}
    ┣📒 <b>Требования:</b> 600 ударов
    ┖🚀 <b>Преимущества:</b> бонус +70 жизней/ударов
    
    ┎⚔️ Ранг: <b>Забивной{'</b> (ваше звание)' if user_rank == 'забивной' else '</b>'}
    ┣📒 <b>Требования:</b> 800 ударов
    ┖🚀 <b>Преимущества:</b> бонус +80 жизней/ударов
    
    ┎⚔️ Ранг: <b>Главный{'</b> (ваше звание)' if user_rank == 'главный' else '</b>'}
    ┣📒 <b>Требования:</b> 1000 ударов
    ┖🚀 <b>Преимущества:</b> бонус +90 жизней/ударов                      
    ''')


def reply_message(opponent_name, opponent_username, selected_user, opponent, next_rang):
    return textwrap.dedent(f'''
        ┎Ты успешно уебал уебка! <a href='https://t.me/@{opponent_username}/'>{opponent_name}</a>👊
        ┃
        ┣У тебя остался(ось) {selected_user.fuck} удар(ов)🔰
        ┖У <a href='https://t.me/@{opponent_username}/'>{opponent_name}</a>, осталось {opponent.lives} жизнь(ей)❤️
        ┖До нового ранга: {next_rang}
    ''')


def profile_text(profile, next_rang):
    return textwrap.dedent(f'''
    ┎🔍 <b>Профиль пользователя</b> 🔍
    ┃
    ┣💎 Привилегия: {profile.vip_rank}
    ┃
    ┣🎲 Ранг: {profile.rank}
    ┣👤 Имя: <b>{profile.name}</b>
    ┣💰 Баланс: <b>{profile.balance}</b>
    ┣❤️ Жизней осталось: <b>{profile.lives}</b>
    ┃
    ┣📅 Дата регистрации:
    ┃               <b>{profile.registration_time}</b>
    ┃
    ┣⚔️ Осталось ударов: <b>{profile.fuck}</b>
    ┣📥 Макс ударов: <b>{profile.fucked_up}</b>
    ┣🏆 До нового ранга осталось:
    ┃               {next_rang} удар(ов)
    ┃
    ┣ <b>Закончились жизни и удары?
    ┣ Жми кнопку ниже ⬇</b>
    ┗━━━━━━━━━━━━━━━━━━━━━━━━━━
''')
